{
    "必修课程": [
        {
            "预备知识": [
                {
                    "集合": [
                        {
                            "集合的概念与表示": [
                                "①通过实例，了解集合的含义，理解元素与集合的属于关系。\n",
                                "②针对具体问题，能在自然语言和图形语言的基础上，用符号\n",
                                "语言刻画集合。\n",
                                "③在具体情境中，了解全集与空集的含义。\n"
                            ],
                            "集合的基本关系": [
                                "理解集合之间包含与相等的含义，能识别给定集合的子集。\n"
                            ],
                            "集合的基本运算": [
                                "①理解两个集合的并集与交集的含义，能求两个集合的并集与\n",
                                "交集。\n",
                                "②理解在给定集合中一个子集的补集的含义，能求给定子集的\n",
                                "补集。\n",
                                "③能使用Ｖｅｎｎ图表达集合的基本关系与基本运算，体会图形对\n",
                                "理解抽象概念的作用。\n"
                            ]
                        }
                    ],
                    "常用逻辑用语": [
                        {
                            "必要条件、充分条件、充要条件": [
                                "①通过对典型数学命题的梳理，理解必要条件的意义，理解性\n",
                                "质定理与必要条件的关系。\n",
                                "②通过对典型数学命题的梳理，理解充分条件的意义，理解判\n",
                                "定定理与充分条件的关系。\n",
                                "③通过对典型数学命题的梳理，理解充要条件的意义，理解数\n",
                                "学定义与充要条件的关系。\n"
                            ],
                            "全称量词与存在量词": [
                                "通过已知的数学实例，理解全称量词与存在量词的意义。\n"
                            ],
                            "全称量词命题与存在量词命题的否定": [
                                "①能正确使用存在量词对全称量词命题进行否定。\n",
                                "②能正确使用全称量词对存在量词命题进行否定。\n"
                            ]
                        }
                    ],
                    "相等关系与不等关系": [
                        {
                            "等式与不等式的性质": [
                                "梳理等式的性质，理解不等式的概念，掌握不等式的性质。\n"
                            ],
                            "基本不等式": [
                                "掌握基本不等式槡犪犫≤\n",
                                "（犪，犫≥０）。结合具体实例，能用\n",
                                "犪＋犫\n",
                                "２\n",
                                "６１\n",
                                "基本不等式解决简单的最大值或最小值问题。\n"
                            ]
                        }
                    ],
                    "从函数观点看一元二次方程和一元二次不等式": [
                        {
                            "从函数观点看一元二次方程": [
                                "会结合一元二次函数的图象，判断一元二次方程实根的存在性\n",
                                "及实根的个数，了解函数的零点与方程根的关系。\n"
                            ],
                            "从函数观点看一元二次不等式": [
                                "①经历从实际情境中抽象出一元二次不等式的过程，了解一元\n",
                                "二次不等式的现实意义。能借助一元二次函数求解一元二次不等式，\n",
                                "并能用集合表示一元二次不等式的解集。\n",
                                "②借助一元二次函数的图象，了解一元二次不等式与相应函数、\n",
                                "方程的联系 （参见案例１）。\n"
                            ]
                        }
                    ]
                }
            ],
            "函数": [
                {
                    "函数概念与性质": [
                        {
                            "函数概念": [
                                "①在初中用变量之间的依赖关系描述函数的基础上，用集合语\n",
                                "言和对应关系刻画函数，建立完整的函数概念 （参见案例２），体会\n",
                                "集合语言和对应关系在刻画函数概念中的作用。了解构成函数的要\n",
                                "素，能求简单函数的定义域。\n",
                                "②在实际情境中，会根据不同的需要选择恰当的方法 （如图象\n",
                                "法、列表法、解析法）表示函数，理解函数图象的作用。\n",
                                "③通过具体实例，了解简单的分段函数，并能简单应用。\n"
                            ],
                            "函数性质": [
                                "①借助函数图象，会用符号语言表达函数的单调性、最大值、\n",
                                "最小值，理解它们的作用和实际意义。\n",
                                "②结合具体函数，了解奇偶性的概念和几何意义。\n",
                                "③结合三角函数，了解周期性的概念和几何意义。\n",
                                "９１\n"
                            ],
                            " 函数的形成与发展": [
                                "收集、阅读函数的形成与发展的历史资料，撰写小论文，论述\n",
                                "函数发展的过程、重要结果、主要人物、关键事件及其对人类文明\n",
                                "的贡献。\n"
                            ]
                        }
                    ],
                    "幂函数、指数函数、对数函数": [
                        {
                            "幂函数": [
                                "通过具体实例，结合\n",
                                "图象，理解它们的变化规律，了解幂函数。\n"
                            ],
                            "指数函数": [
                                "①通过对有理数指数幂犪\n",
                                "指数幂的拓展过程，掌握指数幂的运算性质。\n",
                                "②通过具体实例，了解指数函数的实际意义，理解指数函数的\n",
                                "概念。\n",
                                "③能用描点法或借助计算工具画出具体指数函数的图象，探索\n",
                                "并理解指数函数的单调性与特殊点。\n"
                            ],
                            "对数函数": [
                                "①理解对数的概念和运算性质，知道用换底公式能将一般对数\n",
                                "转化成自然对数或常用对数。\n",
                                "②通过具体实例，了解对数函数的概念。能用描点法或借助计\n",
                                "狀 （犪＞０，且犪≠１；犿，狀 为整数，且\n",
                                "狀＞０）、实数指数幂犪\n",
                                "狓（犪＞０，且犪≠１；狓∈犚）含义的认识，了解\n",
                                "犿\n",
                                "０２\n",
                                "算工具画出具体对数函数的图象，探索并了解对数函数的单调性与\n",
                                "特殊点。\n",
                                "③知道对数函数\n",
                                "狔＝ｌｏｇ犪狓 与指数函数\n",
                                "狔＝犪\n",
                                "狓 互为反函数 （犪＞０，\n",
                                "且犪≠１）。\n",
                                "④  收集、阅读对数概念的形成与发展的历史资料，撰写小论\n",
                                "文，论述对数发明的过程以及对数对简化运算的作用。\n"
                            ]
                        }
                    ],
                    "三角函数": [
                        {
                            "角与弧度": [
                                "了解任意角的概念和弧度制，能进行弧度与角度的互化，体会\n",
                                "引入弧度制的必要性 （参见案例３）。\n"
                            ],
                            "三角函数概念和性质": [
                                "①借助单位圆理解三角函数 （正弦、余弦、正切）的定义，能\n",
                                "画出这些三角函数的图象，了解三角函数的周期性、单调性、奇偶\n",
                                "性、最大 （小）值。借助单位圆的对称性，利用定义推导出诱导公\n",
                                "式 （α±π/2，α±π的正弦、余弦、正切）。\n",
                                "②借助图象理解正弦函数、余弦函数在 ［０，２π］上，正切函数\n",
                                "在（－π/２，π/２）上的性质。\n",
                                "１２\n",
                                "③结合具体实例，了解y＝Aｓｉｎ（ωx＋φ）的实际意义；能借助\n",
                                "图象理解 参 数ω，φ，A 的 意 义，了 解 参 数 的 变 化 对 函 数 图 象 的\n",
                                "影响。\n"
                            ],
                            "同角三角函数的基本关系式": [
                                "理解同角三角函数的基本关系式：ｓｉｎ２X＋ｃｏｓ２X＝１，ｓｉｎx/ｃｏｓx = \n",
                                "ｔａｎx。\n"
                            ],
                            "三角恒等变换": [
                                "①经历推导两角差余弦公式的过程，知道两角差余弦公式的\n",
                                "意义。\n",
                                "②能从两角差的余弦公式推导出两角和与差的正弦、余弦、正\n",
                                "切公式，二倍角的正弦、余弦、正切公式，了解它们的内在联系。\n",
                                "③能运用上述公式进行简单的恒等变换 （包括推导出积化和差、\n",
                                "和差化积、半角公式，这三组公式不要求记忆）。\n"
                            ]
                        }
                    ],
                    "函数应用": [
                        {
                            "二分法与求方程近似解": [
                                "①结合学过的函数图象，了解函数零点与方程解的关系。\n",
                                "②结合具体连续函数及其图象的特点，了解函数零点存在定理，\n",
                                "探索用二分法求方程近似解的思路并会画程序框图，能借助计算工\n",
                                "２２\n",
                                "具用二分法求方程近似解，了解用二分法求方程近似解具有一般性。\n"
                            ],
                            "函数与数学模型": [
                                "①理解函数模型是描述客观世界中变量关系和规律的重要数学\n",
                                "语言和工具。在实际情境中，会选择合适的函数类型刻画现实问题\n",
                                "的变化规律。\n",
                                "②结合现实情境中的具体问题，利用计算工具，比较对数函数、\n",
                                "一元一次函数、指数函数增长速度的差异，理解 “对数增长” “直线\n",
                                "上升“指数爆炸”等术语的现实含义。\n",
                                "③收集、阅读一些现实生活、生产实际或者经济领域中的数学模\n",
                                "型，体会人们是如何借助函数刻画实际问题的，感悟数学模型中参数\n",
                                "的现实意义。\n"
                            ]
                        }
                    ]
                }
            ],
            "几何与代数": [
                {
                    "平面向量及其应用": [
                        {
                            "向量概念": [
                                "①通过对力、速度、位移等的分析，了解平面向量的实际背景，\n",
                                "理解平面向量的意义和两个向量相等的含义。\n",
                                "②理解平面向量的几何表示和基本要素。\n",
                                "５２\n"
                            ],
                            "向量运算": [
                                "①借助实例和平面向量的几何表示，掌握平面向量加、减运算\n",
                                "及运算规则，理解其几何意义。\n",
                                "②通过实例分析，掌握平面向量数乘运算及运算规则，理解其\n",
                                "几何意义。理解两个平面向量共线的含义。\n",
                                "③了解平面向量的线性运算性质及其几何意义。\n",
                                "④通过物理中功等实例，理解平面向量数量积的概念及其物理\n",
                                "意义，会计算平面向量的数量积。\n",
                                "⑤通过几何直观，了解平面向量投影的概念以及投影向量的意\n",
                                "义 （参见案例９）。\n",
                                "⑥会用数量积判断两个平面向量的垂直关系。\n"
                            ],
                            "向量基本定理及坐标表示": [
                                "①理解平面向量基本定理及其意义。\n",
                                "②借助平面直角坐标系，掌握平面向量的正交分解及坐标表示。\n",
                                "③会用坐标表示平面向量的加、减运算与数乘运算。\n",
                                "④能用坐标表示平面向量的数量积，会表示两个平面向量的\n",
                                "夹角。\n",
                                "⑤能用坐标表示平面向量共线、垂直的条件。\n"
                            ],
                            "向量应用与解三角形": [
                                "①会用向量方法解决简单的平面几何问题、力学问题以及其他\n",
                                "实际问题，体会向量在解决数学和实际问题中的作用。\n",
                                "②借助向量的运算，探索三角形边长与角度的关系，掌握余弦\n",
                                "定理、正弦定理。\n",
                                "③能用余弦定理、正弦定理解决简单的实际问题。\n"
                            ]
                        }
                    ],
                    "复数": [
                        {
                            "复数的概念": [
                                "①通过方程的解，认识复数。\n",
                                "②理解 复 数 的 代 数 表 示 及 其 几 何 意 义，理 解 两 个 复 数 相 等 的\n",
                                "含义。\n"
                            ],
                            "复数的运算": [
                                "掌握复数代数表示式的四则运算，了解复数加、减运算的几何\n",
                                "意义。\n"
                            ],
                            " 复数的三角表示": [
                                "通过复数的几何意义，了解复数的三角表示，了解复数的代数\n",
                                "表示与三角表示之间的关系，了解复数乘、除运算的三角表示及其\n",
                                "几何意义。\n"
                            ]
                        }
                    ],
                    "立体几何初步": [
                        {
                            "基本立体图形": [
                                "①利用实物、计算机软件等观察空间图形，认识柱、锥、台、\n",
                                "球及简单组合体的结构特征，能运用这些特征描述现实生活中简单\n",
                                "物体的结构。\n",
                                "②知道球、棱柱、棱锥、棱台的表面积和体积的计算公式，能\n",
                                "用公式解决简单的实际问题。\n",
                                "７２\n",
                                "③能用斜二测法画出简单空间图形 （长方体、球、圆柱、圆锥、\n",
                                "棱柱及其简单组合）的直观图。\n"
                            ],
                            "基本图形位置关系": [
                                "①借助长方体，在直观认识空间点、直线、平面的位置关系的\n",
                                "基础上，抽象出空间点、直线、平面的位置关系的定义，了解以下\n",
                                "基本事实［１］和定理。\n",
                                "基本事实１：过不在一条直线上的三个点，有且只有一个平面。\n",
                                "基本事实２：如果一条直线上的两个点在一个平面内，那么这条\n",
                                "直线在这个平面内。\n",
                                "基本事实３：如果两个不重合的平面有一个公共点，那么它们有\n",
                                "且只有一条过该点的公共直线。\n",
                                "基本事实４：平行于同一条直线的两条直线平行。\n",
                                "定理：如果空间中两个角的两条边分别对应平行，那么这两个\n",
                                "角相等或互补。\n",
                                "②从上述定义和基本事实出发，借助长方体，通过直观感知，\n",
                                "了解空间中直线与直线、直线与平面、平面与平面的平行和垂直的\n",
                                "关系，归纳出以下性质定理，并加以证明。\n",
                                "◆ 一条直线与一个平面平行，如果过该直线的平面与此平面相\n",
                                "交，那么该直线与交线平行。\n",
                                "◆ 两个平面平行，如果另一个平面与这两个平面相交，那么两\n",
                                "条交线平行。\n",
                                "◆ 垂直于同一个平面的两条直线平行。\n",
                                "◆ 两个平面垂直，如果一个平面内有一条直线垂直于这两个平\n",
                                "面的交线，那么这条直线与另一个平面垂直。\n",
                                "③从上述定义和基本事实出发，借助长方体，通过直观感知，\n",
                                "了解空间中直线与直线、直线与平面、平面与平面的平行和垂直的\n",
                                "［１］ 基本事实１～４也称公理。\n",
                                "８２\n",
                                "关系，归纳出以下判定定理。\n",
                                "◆ 如果平面外一条直线与此平面内的一条直线平行，那么该直\n",
                                "线与此平面平行。\n",
                                "◆ 如果一个平面内的两条相交直线与另一个平面平行，那么这\n",
                                "两个平面平行。\n",
                                "◆ 如果一条直线与一个平面内的两条相交直线垂直，那么该直\n",
                                "线与此平面垂直。\n",
                                "◆ 如果一个平面过另一个平面的垂线，那么这两个平面垂直。\n",
                                "④能用已获得的结论证明空间基本图形位置关系的简单命题。\n"
                            ],
                            " 几何学的发展": [
                                "收集、阅读几何学发展的历史资料，撰写小论文，论述几何学\n",
                                "发展的过程、重 要 结 果、主 要 人 物、关 键 事 件 及 其 对 人 类 文 明 的\n",
                                "贡献。\n"
                            ]
                        }
                    ]
                }
            ],
            "概率与统计": [
                {
                    "概率": [
                        {
                            "随机事件的条件概率": [
                                "①结合古典概型，了解条件概率，能计算简单随机事件的条件\n",
                                "概率。\n",
                                "②结合古典概型，了解条件概率与独立性的关系。\n",
                                "③结合古典概型，会利用乘法公式计算概率。\n",
                                "④结合古典概型，会利用全概率公式计算概率。 了解贝叶斯\n",
                                "公式。\n"
                            ],
                            "离散型随机变量及其分布列": [
                                "①通过具体实例，了解离散型随机变量的概念，理解离散型随\n",
                                "机变量分布列及其数字特征 （均值、方差）。\n",
                                "②通过具体实例，了解伯努利试验，掌握二项分布及其数字特\n",
                                "征，并能解决简单的实际问题。\n",
                                "③通过具体实例，了解超几何分布及其均值，并能解决简单的\n",
                                "实际问题。\n"
                            ],
                            "正态分布": [
                                "①通过误差模型，了解服从正态分布的随机变量。通过具体实\n",
                                "７４\n",
                                "例，借助频率直方图的几何直观，了解正态分布的特征。\n",
                                "②了解正态分布的均值、方差及其含义。\n"
                            ]
                        }
                    ],
                    " 统计": [
                        {
                            "获取数据的基本途径及相关概念": [
                                "①知道获取数据的基本途径，包括：统计报表和年鉴、社会调\n",
                                "查、试验设计、普查和抽样、互联网等。\n",
                                "②了解总体、样本、样本量的概念，了解数据的随机性。\n"
                            ],
                            "抽样": [
                                "①简单随机抽样\n",
                                "通过实例，了解简单随机抽样的含义及其解决问题的过程，掌\n",
                                "握两种简单随机抽样方法：抽签法和随机数法。会计算样本均值和\n",
                                "样本方差，了解样本与总体的关系。\n",
                                "②分层随机抽样\n",
                                "通过实例，了解分层随机抽样的特点和适用范围，了解分层随\n",
                                "机抽样的必要性，掌握各层样本量比例分配的方法。结合具体实例，\n",
                                "掌握分层随机抽样的样本均值和样本方差 （参见案例１３）。\n",
                                "③抽样方法的选择\n",
                                "在简单的实际情境中，能根据实际问题的特点，设计恰当的抽\n",
                                "样方法解决问题。\n"
                            ],
                            "统计图表": [
                                "能根据实际问题的特点，选择恰当的统计图表对数据进行可视\n",
                                "化描述，体会合理使用统计图表的重要性。\n"
                            ],
                            "用样本估计总体": [
                                "①结合实例，能用样本估计总体的集中趋势参数 （平均数、中\n",
                                "位数、众数），理解集中趋势参数的统计含义。\n",
                                "②结合实例，能用样本估计总体的离散程度参数 （标准差、方\n",
                                "差、极差），理解离散程度参数的统计含义。\n",
                                "③结合实例，能用样本估计总体的取值规律。\n",
                                "２３\n",
                                "④结合实例，能用样本估计百分位数，理解百分位数的统计含\n",
                                "义 （参见案例１４）。\n"
                            ]
                        }
                    ]
                }
            ],
            "数学建模活动与数学探究活动": [
                { }
            ]
        }
    ],
        "选择性必修课程": [
            {
                "函数": [
                    {
                        "数列": [
                            {
                                "数列概念": [
                                    "通过日常生 活 和 数 学 中 的 实 例，了 解 数 列 的 概 念 和 表 示 方 法\n",
                                    "（列表、图象、通项公式），了解数列是一种特殊函数。\n"
                                ],
                                "等差数列": [
                                    "①通过生活中的实例，理解等差数列的概念和通项公式的意义。\n",
                                    "②探索并掌握等差数列的前狀 项和公式，理解等差数列的通项\n",
                                    "公式与前狀项和公式的关系。\n",
                                    "③能在具体的问题情境中，发现数列的等差关系，并解决相应\n",
                                    "的问题。\n",
                                    "④体会等差数列与一元一次函数的关系。\n"
                                ],
                                "等比数列": [
                                    "①通过生活中的实例，理解等比数列的概念和通项公式的意义。\n",
                                    "②探索并掌握等比数列的前狀 项和公式，理解等比数列的通项\n",
                                    "公式与前狀项和公式的关系。\n",
                                    "③能在具体的问题情境中，发现数列的等比关系，并解决相应\n",
                                    "的问题。\n",
                                    "④体会等比数列与指数函数的关系。\n"
                                ],
                                " 数学归纳法": [
                                    "了解数学归纳法的原理，能用数学归纳法证明数列中的一些简\n",
                                    "单命题。\n",
                                    "８３\n"
                                ]
                            }
                        ],
                        "一元函数导数及其应用": [
                            {
                                "导数概念及其意义": [
                                    "①通过实例分析，经历由平均变化率过渡到瞬时变化率的过程，\n",
                                    "了解导数概念的实际背景，知道导数是关于瞬时变化率的数学表达，\n",
                                    "体会导数的内涵与思想。\n",
                                    "②体会极限思想。\n",
                                    "③通过函数图象直观理解导数的几何意义。\n"
                                ],
                                "导数运算": [
                                    "①能 根 据 导 数 定 义 求 函 数狔＝犮，狔＝狓，狔＝狓，狔＝槡狓的导数。\n",
                                    "②能利用给出的基本初等函数的导数公式和导数的四则运算法\n",
                                    "则，求简单函数的导数；能求简单的复合函数 （限于形如\n",
                                    "犳（犪狓＋的导数\n",
                                    "③会使用导数公式表。\n"
                                ],
                                "导数在研究函数中的应用": [
                                    "①结合实例，借助几何直观了解函数的单调性与导数的关系；\n",
                                    "能利用导数研究函数的单调性；对于多项式函数，能求不超过三次\n",
                                    "的多项式函数的单调区间。\n",
                                    "②借助函数的图象，了解函数在某点取得极值的必要条件和充\n",
                                    "分条件；能利用导数求某些函数的极大值、极小值以及给定闭区间\n",
                                    "上不超过三次的多项式函数的最大值、最小值；体会导数与单调性、\n",
                                    "极值、最大 （小）值的关系。\n",
                                    "９３\n"
                                ],
                                " 微积分的创立与发展": [
                                    "收集、阅读对微积分的创立和发展起重大作用的有关资料，包\n",
                                    "括一些重要历史人物 （牛顿、莱布尼茨、柯西、魏尔斯特拉斯等）\n",
                                    "和事件，采取独立完成或者小组合作的方式，完成一篇有关微积分\n",
                                    "创立与发展的研究报告。\n"
                                ]
                            }
                        ]
                    }
                ],
                "几何与代数": [
                    {
                        "空间向量与立体几何": [
                            {
                                "空间直角坐标系": [
                                    "①在平面直角坐标系的基础上，了解空间直角坐标系，感受建\n",
                                    "立空间直角坐标系的必要性，会用空间直角坐标系刻画点的位置。\n",
                                    "②借助特殊长方体 （所有棱分别与坐标轴平行）顶点的坐标，\n",
                                    "探索并得出空间两点间的距离公式。\n"
                                ],
                                "空间向量及其运算": [
                                    "①经历由平面向量推广到空间向量的过程，了解空间向量的概念。\n",
                                    "②经历由平面向量的运算及其法则推广到空间向量的过程。\n"
                                ],
                                "向量基本定理及坐标表示": [
                                    "①了解空间向量基本定理及其意义，掌握空间向量的正交分解\n",
                                    "及其坐标表示。\n",
                                    "②掌握空间向量的线性运算及其坐标表示。\n",
                                    "③掌握空间向量的数量积及其坐标表示。\n",
                                    "④了解空间向量投影的概念以及投影向量的意义 （参见案例９）。\n"
                                ],
                                "空间向量的应用": [
                                    "①能用向量语言描述直线和平面，理解直线的方向向量与平面\n",
                                    "２４\n",
                                    "的法向量。\n",
                                    "②能用向量语言表述直线与直线、直线与平面、平面与平面的\n",
                                    "夹角以及垂直与平行关系。\n",
                                    "③能用向量方法证明必修内容中有关直线、平面位置关系的判\n",
                                    "定定理。\n",
                                    "④能用向量方法解决点到直线、点到平面、相互平行的直线、\n",
                                    "相互平行的平面的距离问题 （参见案例１６）和简单夹角问题，并能\n",
                                    "描述解决这一类问题的程序，体会向量方法在研究几何 问 题 中 的\n",
                                    "作用。\n"
                                ]
                            }
                        ],
                        "平面解析几何": [
                            {
                                "直线与方程": [
                                    "①在平面直角坐标系中，结合具体图形，探索确定直线位置的\n",
                                    "几何要素。\n",
                                    "②理解直线的倾斜角和斜率的概念，经历用代数方法刻画直线\n",
                                    "斜率的过程，掌握过两点的直线斜率的计算公式。\n",
                                    "③能根据斜率判定两条直线平行或垂直。\n",
                                    "④根据确定直线位置的几何要素，探索并掌握直线方程的几种\n",
                                    "形式 （点斜式、两点式及一般式）。\n",
                                    "⑤能用解方程组的方法求两条直线的交点坐标。\n",
                                    "⑥探索并掌握平面上两点间的距离公式、点到直线的距离公式，\n",
                                    "３４\n",
                                    "会求两条平行直线间的距离。\n"
                                ],
                                "圆与方程": [
                                    "①回顾确定圆的几何要素，在平面直角坐标系中，探索并掌握\n",
                                    "圆的标准方程与一般方程。\n",
                                    "②能根据给定直线、圆的方程，判断直线与圆、圆与圆的位置\n",
                                    "关系。\n",
                                    "③能用直线和圆的方程解决一些简单的数学问题与实际问题。\n"
                                ],
                                "圆锥曲线与方程": [
                                    "①了解圆锥曲线的实际背景，感受圆锥曲线在刻画现实世界和\n",
                                    "解决实际问题中的作用。\n",
                                    "②经历从具体情境中抽象出椭圆的过程，掌握椭圆的定义、标\n",
                                    "准方程及简单几何性质。\n",
                                    "③了解抛物线与双曲线的定义、几何图形和标准方程，以及它\n",
                                    "们的简单几何性质。\n",
                                    "④通过圆锥曲线与方程的学习，进一步体会数形结合的思想。\n",
                                    "⑤了解椭圆、抛物线的简单应用。\n"
                                ],
                                " 平面解析几何的形成与发展": [
                                    "收集、阅读平面解析几何的形成与发展的历史资料，撰写小论\n",
                                    "文，论述平面解析几何发展的过程、重要结果、主要人物、关键事\n",
                                    "件及其对人类文明的贡献。\n"
                                ]
                            }
                        ]
                    }
                ],
                "概率与统计": [
                    {
                        "计数原理": [
                            {
                                "两个基本计数原理": [
                                    "通过实例，了解分类加法计数原理、分步乘法计数原理及其\n",
                                    "意义。\n"
                                ],
                                "排列与组合": [
                                    "通过实例，理解排列、组合的概念；能利用计数原理推导排列\n",
                                    "数公式、组合数公式。\n",
                                    "６４\n"
                                ],
                                "二项式定理": [
                                    "能用多项式运算法则和计数原理证明二项式定理 （参见案例１７，\n",
                                    "１８），会用二项式定理解决与二项展开式有关的简单问题。\n"
                                ]
                            }
                        ],
                        "概率": [
                            {
                                "随机事件的条件概率": [
                                    "①结合古典概型，了解条件概率，能计算简单随机事件的条件\n",
                                    "概率。\n",
                                    "②结合古典概型，了解条件概率与独立性的关系。\n",
                                    "③结合古典概型，会利用乘法公式计算概率。\n",
                                    "④结合古典概型，会利用全概率公式计算概率。 了解贝叶斯\n",
                                    "公式。\n"
                                ],
                                "离散型随机变量及其分布列": [
                                    "①通过具体实例，了解离散型随机变量的概念，理解离散型随\n",
                                    "机变量分布列及其数字特征 （均值、方差）。\n",
                                    "②通过具体实例，了解伯努利试验，掌握二项分布及其数字特\n",
                                    "征，并能解决简单的实际问题。\n",
                                    "③通过具体实例，了解超几何分布及其均值，并能解决简单的\n",
                                    "实际问题。\n"
                                ],
                                "正态分布": [
                                    "①通过误差模型，了解服从正态分布的随机变量。通过具体实\n",
                                    "７４\n",
                                    "例，借助频率直方图的几何直观，了解正态分布的特征。\n",
                                    "②了解正态分布的均值、方差及其含义。\n"
                                ]
                            }
                        ],
                        "统计": [
                            {
                                "成对数据的统计相关性": [
                                    "①结合实例，了解样本相关系数的统计含义，了解样本相关系\n",
                                    "数与标准化数据向量夹角的关系。\n",
                                    "②结合实例，会通过相关系数比较多组成对数据的相关性。\n"
                                ],
                                "一元线性回归模型": [
                                    "①结合具体实例，了解一元线性回归模型的含义，了解模型参\n",
                                    "数的统计意义，了解最小二乘原理，掌握一元线性回归模型参数的\n",
                                    "最小二乘估计方法，会使用相关的统计软件。\n",
                                    "②针对实际问题，会用一元线性回归模型进行预测。\n",
                                    "①通过实例，理解２×２列联表的统计意义。\n",
                                    "②通过实例，了解２×２列联表独立性检验及其应用。\n"
                                ],
                                "２×２列联表": []
                            }
                        ]
                    }
                ],
                "数学建模活动与数学探究活动": [
                    {  }
                ]
            }
        ]
    }