{
    "必修课程":[
        {
            "预备知识":[
                {
                    "教学提示":[
                        "初中阶段数学知识相对具体，高中阶段数学知识相对抽象。教师应针对这一特征帮助学生完成从初中到高中数学学习的过渡，包括知识与技能、方法与习惯、能力与态度等方面。",
                        "在集合、常用逻辑用语的教学中，教师应创设合适的教学情境， 以义务教育阶段学过的数学内容为载体，引导学生用集合语言和常用逻辑用语梳理、表达学过的相应数学内容。应引导学生理解属于关系是集合的基本关系，了解元素A与由元素A组成的集合｛A｝的差异，即A∈｛A｝，A与｛A｝不相同。在梳理过程中，可以针对学生的实际布置不同的任务，采用自主学习与合作学习相结合的方式组织教学活动。",
                        "在相等关系与不等关系的教学中，应引导学生通过类比学过的等式与不等式的性质，进一步探索等式与不等式的共性与差异。",
                        "在从函数观点看一元二次方程和一元二次不等式的教学中，可以先以讨论具体的一元二次函数变化情况为情境，引导学生发现一元二次函数与一元二次方程的关系，引出一元二次不等式概念；然后进一步引导学生探索一般的一元二次函数与一元二次方程、一元二次不等式的关系，归纳总结出用一元二次函数解一元二次不等式的程序。",
                        "教学中，要根据内容的定位和教育价值，关注数学学科核心素养的培养。要让学生逐渐养成借助直观理解概念、进行逻辑推理的思维习惯，以及独立思考、合作交流的学习习惯，引导学生感悟高中阶段数学课程的特征，适应高中阶段的数学学习。"
                    ],
                    "学业要求":[
                        "能够在现实情境或数学情境中，概括出数学对象的一般特征， 并用集合语言予以表达。初步学会用三种语言 （自然语言、图形语言、符号语言）表达数学研究对象，并能进行转换。掌握集合的基本关系与基本运算。", 
                        "能够借助常用逻辑用语进行数学表达、论证和交流，体会常用逻辑用语在数学中的作用。", 
                        "能够从函数观点认识方程和不等式，感悟数学知识之间的关联，认识函数的重要性。掌握等式与不等式的性质。", 
                        "重点提升数学抽象、逻辑推理和数学运算素养。"
                    ]
                }
            ],
            "函数":[
                {
                    "教学提示":[
                        "教师应把本主题的内容视为一个整体，引导学生从变量之间的依赖关系、实数集合之间的对应关系、函数图象的几何直观等角度整体认识函数概念；通过梳理函数的单调性、周期性、奇偶性 （对称性）、最大 （小）值等，认识函数的整体性质；经历运用函数解决实际问题的全过程。",
                        "函数概念的引入，可以用学生熟悉的例子为背景进行抽象。例如，可以从学生已知的、基于变量关系的函数定义入手，引导学生通过生活或数学中的问题，构建函数的一般概念，体会用对应关系定义函数的必要性，感悟数学抽象的层次。", 
                        "函数单调性的教学，要引导学生正确使用符号语言清晰地刻画函数的性质 （参见案例５）。在函数定义域、值域以及函数性质的教学过程中，应避免编制偏题、怪题，避免繁琐的技巧训练。", 
                        "指数函数的教学，应关注指数函数的运算法则和变化规律，引导学生经历从整数指数幂到有理数指数幂、再到实数指数幂的拓展过程，掌握指数函数的运算法则和变化规律。",
                        "对数函数的教学，应通过比较同底数的指数函数和对数函数（例如，y＝２^x 和y＝ｌｏｇ２x），认识它们互为反函数。", 
                        "三角函数的教学，应发挥单位圆的作用，引导学生结合实际情境，借助单位圆的直观，探索三角函数的有关性质 （参见案例６）。在三角恒等变换的教学中，可以采用不同的方式得到三角恒等变换基本公式；也可以在向量的学习中，引导学生利用向量的数量积推导出两角差的余弦公式。",
                        "函数应用的教学，要引导学生理解如何用函数描述客观世界事物的变化规律，体会幂函数、指数函数、对数函数、三角函数等函数与现实世界的密切联系 （参见案例７）。",
                        "鼓励学生运用信息技术学习、探索和解决问题。例如，利用计算器、计算机画出幂函数、指数函数、对数函数、三角函数等的图象，探索、比较它们的变化规律，研究函数的性质，求方程的近似解等 （参见案例８）。",
                        "可以组织学生收集、阅读函数的形成与发展的历史资料，结合内容撰写报告，论述函数发展的过程、重要结果、主要人物、关键事件及其对人类文明的贡献。"
                    ],
                    "学业要求":[
                        "能够从两个变量之间的依赖关系、实数集合之间的对应关系、 函数图象的几何直观等多个角度，理解函数的意义与数学表达；理解函数符号表达与抽象定义之间的关联，知道函数抽象概念的意义。",
                        "能够理解函数的单调性、最大 （小）值，了解函数的奇偶性、 周期性；掌握一些基本函数类 （一元一次函数、反比例函数、一元二次函数、幂函数、指数函数、对数函数、三角函数等）的背景、 概念和性质。", 
                        "能够对简单的实际问题，选择适当的函数构建数学模型，解决问题；能够从函数观点认识方程，并运用函数的性质求方程的近似解；能够从函数观点认识不等式，并运用函数的性质解不等式。",
                        "重点提升数学抽象、数学建模、数学运算、直观想象和逻辑推理素养。"
                    ]
                }
            ],
            "几何与代数":[
                {
                    "教学提示":[
                        "在平面向量及其应用的教学中，应从力、速度、位移等实际情境入手，从物理、几何、代数三个角度理解向量的概念与运算法则， 引导学生运用类比的方法探索实数运算与向量运算的共性与差异。 可以通过力的分解引出向量基本定理，建立基的概念和向量的坐标表示。可以引导学生运用向量解决一些物理和几何问题。例如，利用向量计算力使物体沿某方向运动所作的功，利用向量解决与平面内两条直线平行或垂直有关的问题等。对于向量的非正交分解只要求学生一般了解，不必展开。",
                        "在复数的教学中，应注重对复数的表示及几何意义的理解，避免繁琐的计算与技巧训练。对于学有余力的学生，可以安排一些引申内容，如复数的三角表示等。可以适当融入数学文化，让学生体会数系扩充过程中理性思维的作用 （参见案例１０）。",
                        "立体几何初步的教学重点是帮助学生逐步形成空间观念，应遵循从整体到局部、从具体到抽象的原则，提供丰富的实物模型或利用计算机软件呈现空间几何体，帮助学生认识空间几何体的结构特征，进一步掌握在平面上表示空间图形的方法和技能。通过对图形的观察和操作，引导学生发现和提出描述基本图形平行、垂直关系的命题，逐步学会用准确的数学语言表达这些命题，直观解释命题的含义和表述证明的思路，并证明其中一些命题；对相应的判定定理只要求直观感知、操作确认，在选择性必修课程中将用向量方法对这些定理加以论证。",
                        "可以使用信息技术展示空间图形，为理解和掌握图形几何性质（包括证明）提供直观。教师可以指导和帮助学生选择一些立体几何问题作为数学探究活动的课题 （参见案例１１）。",
                        "可以组织学生收集、阅读几何学发展的历史资料，结合内容撰写报告，论述几何学发展过程中的重要结果、主要人物、关键事件及其对人类文明的贡献。"
                    ],
                    "学业要求":[
                        "能够从多种角度理解向量概念和运算法则，掌握向量基本定理；能够运用向量运算解决简单的几何和物理问题，知道数学运算与逻辑推理的关系。",
                        "能够理解复数的概念，掌握复数代数表示式的四则运算。",
                        "能够通过直观图理解空间图形，掌握基本空间图形及其简单组合体的概念和基本特征，解决简单的实际问题。能够运用图形的概念描述图形的基本关系和基本结果。能够证明简单的几何命题 （平行、垂直的性质定理），并会进行简单应用。",
                        "重点提升直观想象、逻辑推理、数学运算和数学抽象素养。"
                    ]
                }
            ],
            "概率与统计":[
                {
                    "教学提示":[
                        "在概率的教学中，应引导学生通过日常生活中的实例了解随机事件与概率的意义。在随机事件和样本空间的教学中，应引导学生通过古典概型，认识样本空间，理解随机事件发生的含义；理解古典概型的特征：试验结果的有限性和每一个试验结果出现的等可能性，知道只有在这种特征下，才能定义出古典概型中随机事件发生的概率。教学中要适当介绍基本计数方法 （如树状图、列表等），计算古典概率中随机事件发生的概率。",
                        "在统计的教学中，应引导学生根据实际问题的需求，选择不同的抽样方法获取数据，理解数据蕴含的信息；根据数据分析的需求， 选择适当的统计图表描述和表达数据，并从样本数据中提取需要的数字特征，估计总体的统计规律，解决相应的实际问题。对统计中的基本概念 （如总体、样本、样本量等），应结合具体问题进行描述性说明，在此基础上适当引入严格的定义，并利用数字特征 （平均值、方差等）和数据直观图表 （直方图、散点图等）进行数据分析。",
                        "统计的教学活动应通过典型案例进行。教学中应通过对一些典型案例的处理，使学生经历较为系统的数据处理全过程，在此过程中学习数据分析的方法，理解数据分析的思路，运用所学知识和方法解决实际问题。",
                        "可以鼓励学生尽可能运用计算器、计算机进行模拟活动，处理数据，更好地体会概率的意义和统计思想。例如，利用计算器产生随机数来模拟掷硬币试验等，利用计算机来计算样本量较大的数据的样本均值、样本方差等。"
                    ],
                    "学业要求":[
                        "能够掌握古典概型的基本特征，根据实际问题构建概率模型， 解决简单的实际问题。能够借助古典概型初步认识有限样本空间、 随机事件，以及随机事件的概率。",
                        "能够根据实际问题的需求，选择恰当的抽样方法获取样本数据， 并从中提取需要的数字特征推断总体。能够正确运用数据分析的方法解决简单的实际问题。",
                        "能够区别统计思维与确定性思维的差异、归纳推断与演绎证明的差异。能够结合具体问题，理解统计推断结果的或然性，正确运用统计结果解释实际问题。",
                        "重点提升数据分析、数学建模、逻辑推理和数学运算素养。"
                    ]
                }
            ],
            "数学建模活动与数学探究活动":[
                {
                    "教学提示":[
                        "课题可以由教师给定，也可以由学生与教师协商确定。课题研究的过程包括选题、开题、做题、结题四个环节。学生需要撰写开题报告，教师要组织开展开题交流活动，开题报告应包括选题意义、 文献综述、解决问题思路、研究计划、预期结果等。做题是解决问题的过程，包括描述问题、数学表达、建立模型、求解模型、得到结论、反思完善等。结题包括撰写研究报告和报告研究结果，由教师组织学生开展结题答辩。根据选题的内容，报告可以采用专题作业、测量报告、算法程序、制作的实物、研究报告或小论文等多种形式。（参见案例１５）",
                        "在数学建模活动与数学探究活动中，鼓励学生使用信息技术。"
                        ],
                    "学业要求":[
                        "经历数学建模活动与数学探究活动的全过程，整理资料，撰写研究报告或小论文，并进行报告、交流。对于研究报告或小论文的评价，教师应组织评价小组，可以邀请校外专家、社会人士、家长等参与评价，也可以组织学生互评。教师要引导学生遵循学术规范， 坚守诚信底线。研究报告或小论文及其评价应存入学生个人学习档案，为大学招生提供参考和依据。学生可以采取独立完成或者小组合作 （２～３人为宜）的方式，完成课题研究 （参见案例１９）。",
                        "重点提升数学建模、数学抽象、数据分析、数学运算、逻辑推理和直观想象素养。"
                    ]
                }
            ]
        }

    ],
    "选择性必修课程":[
        {
            "函数":[
                {
                    "教学提示":[
                        "在数列的教学中，应引导学生通过具体实例 （如购房贷款、放射性物质的衰变、人口增长等），理解等差数列、等比数列的概念、 性质和应用；引导学生掌握数列中各个量之间的基本关系。",
                        "应特别强调数列作为一类特殊的函数在解决实际问题中的作用， 突出等差数列、等比数列的本质，引导学生通过类比的方法探索等差数列与一元一次函数、等比数列与指数函数的联系，加深对数列及函数概念的理解。",
                        "在教学中可以组织学生收集、阅读数列方面的研究成果，特别是我国古代的优秀研究成果，如 “杨辉三角”、 《四元玉鉴》等，撰写小论文，论述数列发展的过程、重要结果、主要人物、关键事件及其对人类文明的贡献，感悟我国古代数学的辉煌成就。",
                        "在一元函数导数及其应用的教学中，应通过丰富的实际背景和具体实例引入导数的概念，例如斜率、增长率、膨胀率、效率、密度、速度、加速度等；应引导学生经历由平均变化率过渡到瞬时变化率的过程，了解导数是如何刻画瞬时变化率的，感悟极限的思想；应引导学生通过具体实例感受导数在研究函数和解决实际问题中的作用，体会导数的意义。学生对导数概念的理解不可能一步到位， 导数概念的学习应该贯穿在一元函数导数及其应用学习的始终。一般地，在高中阶段研究与导数有关的问题中，涉及的函数都是可导函数。",
                        "在教学中可以组织学生收集、阅读微积分创立与发展的历史资料，撰写小论文，论述微积分创立与发展的过程、重要结果、主要人物、关键事件及其对人类文明的贡献。"
                    ],
                    "学业要求":[
                        "能够结合具体实例，理解通项公式对于数列的重要性，知道通项公式是这类函数的解析表达式；通过等差数列和等比数列的研究， 感悟数列是可以用来刻画现实世界中一类具有递推规律事物的数学模型，掌握通项公式与前狀 项和公式的关系；能够运用数列解决简单的实际问题。",
                        "能够通过具体情境，直观理解导数概念，感悟极限思想，知道极限思想是人类深刻认识和表达现实世界必备的思维品质。理解导数是一种借助极限的运算，掌握导数的基本运算规则，能求简单函数和简单复合函数的导数。能够运用导数研究简单函数的性质和变化规律，能够利用导数解决简单的实际问题。知道微积分创立过程， 以及微积分对数学发展的作用。",
                        "重点提升数学抽象、数学运算、直观想象、数学建模和逻辑推理素养。"
                    ]
                }
            ],
            "几何与代数":[
                {
                    "教学提示":[
                        "本主题的研究对象是几何图形，所用的研究方法主要是代数方法。",
                        "在空间向量与立体几何的教学中，应重视以下两方面：第一， 引导学生运用类比的方法，经历向量及其运算由平面向空间的推广过程，探索空间向量与平面向量的共性和差异，引发学生思考维数增加所带来的影响；第二，鼓励学生灵活选择运用向量方法与综合几何方法，从不同角度解决立体几何问题 （如距离问题），通过对比体会向量方法的优势。在上述过程中，引导学生理解向量基本定理的本质，感悟 “基”的思想，并运用它解决立体几何中的问题。 ",
                        "在平面解析几何的教学中，应引导学生经历以下过程：首先， 通过实例了解几何图形的背景，例如，通过行星运行轨道、抛物运动轨迹等，使学生了解圆锥曲线的背景与应用；进而，结合情境清晰地描述图形的几何特征与问题，例如，两点决定一条直线，椭圆是到两个定点的距离之和为定长的动点的轨迹等；再结合具体问题合理地建立坐标系，用代数语言描述这些特征与问题；最后，借助几何图形的特点，形成解决问题的思路，通过直观想象和代数运算得到结果，并给出几何解释，解决问题。",
                        "应充分发挥信息技术的作用，通过计算机软件向学生演示方程中参数的变化对方程所表示的曲线的影响，使学生进一步理解曲线与方程的关系。",
                        "在教学中，可以组织学生收集、阅读平面解析几何的形成与发展的历史资料，撰写小论文，论述平面解析几何发展的过程、重要结果、主要人物、关键事件及其对人类文明的贡献。"
                    ],
                    "学业要求":[
                        "能够理解空间向量的概念、运算、背景和作用；能够依托空间向量建立空间图形及图形关系的想象力；能够掌握空间向量基本定理，体会其作用，并能简单应用；能够运用空间向量解决一些简单的实际问题，体会用向量解决一类问题的思路。",
                        "能够掌握平面解析几何解决问题的基本过程：根据具体问题情境的特点，建立平面直角坐标系；根据几何问题和图形的特点，用代数语言把几何问题转化成为代数问题；根据对几何问题 （图形）的分析，探索解决问题的思路；运用代数方法得到结论；给出代数结论合理的几何解释，解决几何问题。",
                        "能够根据不同的情境，建立平面直线和圆的方程，建立椭圆、 抛物线、双曲线的标准方程，能够运用代数的方法研究上述曲线之间的基本关系，能够运用平面解析几何的思想解决一些简单的实际问题。",
                        "重点提升直观想象、数学运算、数学建模、逻辑推理和数学抽象素养。"
                    ]
                }
            ],
            "概率与统计":[
                {
                    "教学提示":[
                        "教师应通过典型案例开展教学活动，案例的情境应是丰富的、 有趣的、学生熟悉的。在案例教学中要重视过程，层次清楚，从具体到抽象，从实际到理论。",
                        "在计数原理的教学中，应结合具体情境，引导学生理解许多计数问题可以归结为分类和分步两类问题，引导学生根据计数原理分析问题、解决问题。",
                        "在概率的教学中，应引导学生通过具体实例，理解可以用随机变量更好地刻画随机现象，感悟随机变量与随机事件的关系；理解随机事件独立性与条件概率之间的关系；通过二项分布、超几何分布、正态分布的学习，理解随机变量及其分布。在教学过程中，应在引导学生利用所学知识解决一些实际问题的基础上，适当进行严格、准确的描述。",
                        "在统计的教学中，应通过具体案例，引导学生理解两个随机变量的相关性可以通过成对样本数据进行分析；理解利用一元线性回归模型可以研究变量之间的随机关系，进行预测；理解利用２×２列联表可以检验两个随机变量的独立性。在教学过程中，应通过具体案例引导学生参与数据分析的全过程，并鼓励学生使用相应的统计软件。"
                    ],
                    "学业要求":[
                        "能够结合具体实例，识别和理解分类加法计数原理和分步乘法计数原理及其作用，并能够运用这些原理解决简单的实际问题。",
                        "能够结合具体实例，理解排列、组合、二项式定理与两个计数原理的关系，能够运用两个计数原理推导排列、组合、二项式定理的相关公式，并能够运用它们解决简单的实际问题，特别是概率中的某些问题。",
                        "能够结合具体实例，理解随机事件的独立性和条件概率的关系， 理解离散型随机变量在描述随机现象中的作用，掌握两个基本概率模型及其应用，了解正态分布的作用，进一步深入理解随机思想在解决实际问题中的作用。",
                        "能够解决成对数据统计相关性的简单实际问题。能够结合具体实例，掌握运用一元线性回归分析的方法。掌握运用２×２列联表的方法，解决独立性检验的简单实际问题。",
                        "重点提升数据分析、数学建模、逻辑推理、数学运算和数学抽象素养。"
                    ]
                }
            ],
            "数学建模活动与数学探究活动":[
                {
                    "教学提示":[
                        "选题可以在教师的指导下，自主选题，也可以在必修课程中数学建模活动或数学探究活动的研究基础上继续进行深入探究。类似必修课程的要求，课题研究应经历选题、开题、做题、结题四个环节。如果选题不变，需要在研究报告中说明与必修课程中研究的差异，深入研究的新思路、新方法，得到的新结果。根据选题的内容， 报告可以采用专题作业、测量报告、算法程序、制作的实物或研究论文等多种形式。"
                    ],
                    "学业要求":[
                        "参考必修课程的主题五。"
                    ]
                }
            ]
        }
    ],
    "选修课程":[
        {
            "数理类课程":[
                {
                    "教学提示":[],
                    "学业要求":[]
                }
            ],
            "经济、社会、部分理工类课程":[
                {
                    "教学提示":[],
                    "学业要求":[]
                }
            ],
            "人文类课程":[
                {
                    "教学提示":[],
                    "学业要求":[]
                }
            ],
            "艺术体育类课程":[
                {
                    "教学提示":[],
                    "学业要求":[]
                }
            ],
            "拓展、生活、地方、大学先修类课程":[
                {
                    "教学提示":[],
                    "学业要求":[]
                }
            ]
        }

    ]

}